[{
    "class": "fastener",
    "type": "bolt",
    "description": "An externally helical threaded fastener capable of being tightened or released by a twisting force (torque) to a matching nut.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Bolt_and_nut%2C_annotated.jpg/500px-Bolt_and_nut%2C_annotated.jpg",
    "variants": [
        {
            "name":"Anchor bolt", 
            "description":"Bolt designed to allow objects to be attached to concrete. The bolt head is usually placed in concrete before it has cured or placed before the concrete is poured, leaving the threaded end exposed." },
        {
            "name":"Arbor bolt",
            "description": "Bolt with a washer permanently attached and reversed threading. Designed for use in miter saw and other tools to auto tighten during use to prevent blade fall out."
        },
        {"name":"Carriage bolt", 
        "description":"Bolt with a smooth rounded head and a square section to prevent turning followed with a threaded section for a nut."
    },
        {
            "name":"Elevator bolt",
            "description": "Bolt with a large flat head used in conveyor system setups."
        },
        {
            "name": "Hanger bolt",
            "description": "Bolt that has no head, machine threaded body followed by a wood threaded screw tip. Allow nuts to be attached to what is really a screw."
        },
        {
            "name": "Hex bolt",
            "description": "Bolt with a hexagonal head and threaded shank. Section immediately under head may be unthreaded for fastening thicker materials."
        },
        {
            "name": "J bolt",
            "description": "Bolt shaped like the letter J, used for tie downs. Only the straight section is threaded for a nut."
        },
        {
            "name": "Rock bolt",
            "description": "Used in tunnel construction to stabilize walls."
        },
        {
            "name": "Sex bolt or Chicago bolt",
            "description": "Bolt that has a male and female part with interior threads and bolt heads on either end. Commonly used in paper binding."
        },
        {
            "name": "Shoulder bolt or stripper bolt",
            "description": "Bolt with a broad smooth shank and small threaded section at the end used as a pivot pin or attachment point."
        },
        {
            "name": "U-bolt",
            "description": "Bolt shaped like the letter U where the two straight sections are threaded. A straight metal plate with two bolt holes is used with nuts to hold pipes or other round objects to the U-bolt."
        }
    ],
    "materials": [
        {
            "type": "Steel",
            "description": "Most common material, often zinc plated for corrosion resistance."
        },
        {
            "type": "Stainless steel",
            "description": "Resistant to corrosion and rust, used in marine and outdoor applications."
        },
        {
            "type": "Brass",
            "description": "Used for aesthetic purposes or in electrical applications due to its conductivity."
        },
        {
            "type": "Aluminum",
            "description": "Lightweight and resistant to corrosion, used in aerospace and automotive applications."
        },
        {
            "type": "Nylon",
            "description": "Used in applications where non-conductivity and resistance to corrosion are required."
        },
        {
            "type": "Titanium",
            "description": "High strength-to-weight ratio, used in aerospace and high-performance applications."
        }
    ]
}
]