[{
    "class": "tools",
    "type": "hand",
    "description": "A portable provision of accuracy, adaptability, and control. They allow mechanics to carry out intricate tasks, address problems, and maintain equipment. Hand tools are needed for mechanics to operate quickly, enter small spaces, and handle components with dexterity. They are the backbone of a mechanic's trade, providing reliable repairs and expert craftsmanship.",
    "variants": [
        {
            "name": "Screwdriver",
            "description": "With a multitude of uses and precision, screwdrivers are vital instruments for mechanics. They tighten and loosen screws, fasteners, and other components. Mechanics can handle a variety of screw heads thanks to the many types and sizes that are available. Screwdrivers are necessary for handy repairs and adjustments and provide sufficient fastening.",
            "types": [
                {
                    "name": "Flathead",
                    "description": "A screwdriver with a flat blade that fits into the slot of a flat screw head.",
                    "sizes": [
                        "Small",
                        "Medium",
                        "Large"
                    ]
                },
                {
                    "name": "Phillips",
                    "description": "A screwdriver with a cross-shaped tip designed to fit into Phillips screws.",
                    "sizes": [
                        "Small",
                        "Medium",
                        "Large"
                    ]
                },
                {
                    "name": "Torx",
                    "description": "A screwdriver with a star-shaped tip designed for Torx screws, providing better grip and torque.",
                    "sizes": [
                        "T10",
                        "T15",
                        "T20",
                        "T25",
                        "T30"
                    ]
                },
                {
                    "name": "Hex",
                    "description": "A screwdriver with a hexagonal tip used for hex screws, often found in furniture assembly.",
                    "sizes": [
                        "1.5mm",
                        "2mm",
                        "2.5mm",
                        "3mm",
                        "4mm"
                    ]
                }
            ],
            "kits": [
                {
                    "name": "Screwdriver Set",
                    "description": "A set of various screwdrivers, including flathead, Phillips, and Torx types, for versatile use.",
                    "sizes": [
                        "Small",
                        "Medium",
                        "Large"
                    ],
                    "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-22-2710_01_2239c801-0e19-48b4-b0ea-68550bcb6837_400x.jpg?v=1717185129"
                },
                {
                    "name": "Precision Screwdriver Set",
                    "description": "A set of small screwdrivers designed for electronics and delicate work.",
                    "sizes": [
                        "1.0mm",
                        "1.5mm",
                        "2.0mm"
                    ],
                    "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-22-2606_02_400x.jpg?v=1717185596"
                }
            ]
        },
        {
            "name": "Pliers",
            "description": "Pliers are versatile tools that grip, twist, and cut wires and other materials. They come in various types, each designed for specific tasks, such as gripping, cutting, or bending.",
            "types": [
                {
                    "name": "Needle-nose Pliers",
                    "description": "Pliers with long, slender jaws for reaching into tight spaces and gripping small objects."
                },
                {
                    "name": "Slip-joint Pliers",
                    "description": "Pliers with adjustable jaws that can grip various sizes of nuts and bolts."
                },
                {
                    "name": "Cutting Pliers",
                    "description": "Pliers designed specifically for cutting wire and other materials."
                },
                {
                    "name": "Locking Pliers",
                    "description": "Pliers that can be locked in place to hold objects securely. also known as vise grips or mole wrenches, are essential for various uses"
                },
                {
                    "name": "Crimping Pliers",
                    "description": "Pliers used to crimp connectors onto wires, ensuring a secure electrical connection."
                }, 
                {
                    "name": "Channel-lock Pliers",
                    "description": "Pliers with adjustable jaws that can grip larger objects, often used in plumbing."
                },
                {
                    "name": "Diagonal-cutting Pliers",
                    "description": "Pliers with angled cutting edges for precise wire cutting."
                },
                {
                    "name": "Duck bill Jaw Pliers",
                    "description": "Indispensable for mechanics as they serve multiple purposes. They are perfect for tasks like straightening aluminum fins on radiators while providing accuracy without causing damage. Additionally, they excel at tasks like removing fuses and twisting locking wire, providing a secure and comfortable grip throughout."
                },
                {
                    "name": "Groovelock Pliers",
                    "description": "Pliers with adjustable jaws that can grip various sizes of nuts and bolts, similar to slip-joint pliers but with a more secure grip. Their multi-groove ratcheting system provides superior grip with twice the groove positions. The anti-pinch, non-slip ProTouch Grips offer comfort, control, and reduced hand fatigue."
                },
                {
                    "name": "Wire Stripping Pliers",
                    "description": "Pliers designed specifically for stripping insulation from electrical wires, allowing for easy wire preparation.  From installing a stereo head unit, and speakers, to wiring new headlights, these pliers offer seven functions for seamless electrical installation."
                },
                {
                    "kit-size": "6 piece",
                    "description": "A set of pliers that includes various types such as needle-nose, slip-joint, and cutting pliers for versatile use.",
                    "types": [
                        "Needle-nose Pliers",
                        "Slip-joint Pliers",
                        "Cutting Pliers",
                        "Locking Pliers",
                        "Crimping Pliers",
                        "Channel-lock Pliers"
                    ],
                    "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/gearwrench-82204c_01_400x.jpg?v=1717189192"   
            }
            ]
            
    },
    { 
        "name": "Wrenches",
        "description": "Wrenches are essential tools for tightening and loosening nuts and bolts. They come in various types, each designed for specific tasks, such as gripping, turning, or adjusting fasteners.",
        "kit-size": ["8 piece", "10 piece", "12 piece"],
        "images": ["https://cdn.shopify.com/s/files/1/0717/0159/4403/files/apex-9702d_01_400x.jpg?v=1717191995", "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/crescent-adjustable-wrench_400x.jpg?v=1717192560", "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/apex-85196_01_d9c90903-3c05-42d8-bb05-3a719e75b5f7_400x.jpg?v=1717192976", "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-pipe-wrench_400x.jpg?v=1717193857", "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/oil-filter-wrench_400x.jpg?v=1717194125"],
        "variants": [
            {
                "name": "Adjustable Wrench",
                "description": "A wrench with a movable jaw that allows it to grip various sizes of nuts and bolts."
            },
            {
                "name": "Socket Wrench",
                "description": "A wrench that uses interchangeable sockets to fit different sizes of nuts and bolts."
            },
            {
                "name": "Box-end Wrench",
                "description": "A wrench with a closed loop at one end designed to fit over the head of a nut or bolt."
            },
            {
                "name": "Open-end Wrench",
                "description": "A wrench with two open jaws at each end, allowing it to grip nuts and bolts from the sides."
            },
            {
                "name": "Torque Wrench",
                "description": "A wrench that measures the amount of torque applied to a fastener, ensuring proper tightening."
            },
            {
                "name": "Crowfoot Wrench",
                "description": "A wrench with an open-ended design that allows access to fasteners in tight spaces."
            },
            {
                "name": "Oil-filter Wrench",
                "description": "A specialized wrench designed to remove oil filters, often with a strap or chain for grip."
            },
            {
                "name": "Chain Wrench",
                "description": "A wrench that uses a chain to grip and turn large cylindrical objects, such as pipes or oil filters."
            },
            {
                "name": "Pipe Wrench",
                "description": "A wrench designed for gripping and turning pipes, featuring serrated jaws for a secure grip."
            }
        ]
    },
    {
        "name": "Sockets",
        "description": "Sockets are specialized tools used with ratchets or socket wrenches to tighten or loosen nuts and bolts. They come in various sizes and types, allowing for efficient fastening in tight spaces.",
        "Expert-kit": ["39 Pc. 1/2' Drive 6 Point Standard & Deep Impact SAE Socket Set",{"image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/apex-84947n_01_3052ccb3-d6fc-43da-957e-b7c8422500e7_400x.jpg?v=1717424699"}],
        "Second-option": "29PCSHOCKWAVE Impact Duty 1/2' Drive Metric Deep 6 Point Socket Set",
        "types": [
            {
                "name": "Standard Socket",
                "description": "A socket designed for general use, fitting standard nuts and bolts."
            },
            {
                "name": "Deep Socket",
                "description": "A socket with a longer depth, allowing it to reach nuts and bolts in recessed areas."
            },
            {
                "name": "Impact Socket",
                "description": "A heavy-duty socket designed to withstand high torque from impact wrenches."
            },
            {
                "name": "Spark Plug Socket",
                "description": "A specialized socket designed for removing and installing spark plugs in engines."
            },
            {
                "name": "Universal Joint Socket",
                "description": "A socket that allows for angled access to fasteners, useful in tight spaces."
            }
        ]
    },
    {
        "name": "Allen Wrenches",
        "description": "Allen wrenches, also known as hex keys, are L-shaped tools used to drive hexagonal socket screws. They come in various sizes and are essential for assembling furniture, bicycles, and other equipment.",
        "images": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/eklind-60811_01_5f6796fc-d442-4842-bedf-23fc667d9454_400x.jpg?v=1717425140",
        "types": [
            {
                "name": "L-shaped Allen Wrench",
                "description": "A standard hex key with an L-shape, providing leverage for turning screws."
            },
            {
                "name": "T-handle Allen Wrench",
                "description": "An Allen wrench with a T-shaped handle for better grip and torque."
            },
            {
                "name": "Ball-end Allen Wrench",
                "description": "An Allen wrench with a ball-shaped end, allowing for angled access to screws."
            },
            {
                "name": "Socket-style Allen Wrench",
                "description": "An Allen wrench designed to fit into a socket for use with ratchets or power tools."
            }
        ]
    },
    {
        "name": "Hammers",
        "description": "Hammers are versatile tools used for driving nails, breaking objects, and shaping materials. They come in various types, each designed for specific tasks, such as striking, tapping, or prying.",
        "kit-size": "5 piece",
        "images": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/gearwrench-82303d_01_d4701bee-cb27-4fd8-ac0e-82a4e36f8706_400x.jpg?v=1717425464",
        "types": [
            {
                "name": "Claw Hammer",
                "description": "A hammer with a curved claw on one end for removing nails and a flat striking surface on the other."
            },
            {
                "name": "Ball-peen Hammer",
                "description": "A hammer with a rounded end for shaping metal and a flat end for striking."
            },
            {
                "name": "Sledgehammer",
                "description": "A heavy hammer used for breaking concrete, driving stakes, or demolition work."
            },
            {
                "name": "Dead Blow Hammer",
                "description": "A hammer filled with sand or shot to reduce rebound and provide controlled strikes."
            },
            {
                "name": "Rubber Mallet",
                "description": "A soft-faced hammer used for tapping objects without damaging them, often used in woodworking."
            },
            {
                "name": "Cross-peen Hammer",
                "description": "A hammer with a wedge-shaped peen for shaping metal and a flat striking surface."
            }
        ]   
    },
    {
        "name": "Pry Bars",
        "description": "Pry bars, also known as crowbars or wrecking bars, are sturdy tools used for prying, lifting, and removing objects. They come in various sizes and shapes, providing leverage for heavy-duty tasks.",
        "kit-size": ["4 piece", "6 piece"],
        "types": [
            {
                "name": "Flat Pry Bar",
                "description": "A flat, straight bar used for prying and lifting objects, often with a beveled edge for easy insertion."
            },
            {
                "name": "Curved Pry Bar",
                "description": "A pry bar with a curved end for better leverage and access to tight spaces."
            },
            {
                "name": "Wrecking Bar",
                "description": "A heavy-duty pry bar designed for demolition work, often with a chisel-like end for breaking materials."
            },
            {
                "name": "Cat's Paw Pry Bar",
                "description": "A small pry bar with a curved end designed for removing nails and other fasteners."
            }
        ]
    },
    {
        "name": "Files and Rasps",
        "description": "Files and rasps are tools used for shaping, smoothing, and finishing surfaces. They come in various shapes and sizes, allowing for precise material removal and surface preparation.",
        "kit-size": "5 piece",
        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/nicholson-22040nn_01_3e69c4ad-d690-43c0-95b9-bcb0f8c18757_400x.jpg?v=1717435283",
        "types": [
            {
                "name": "Flat File",
                "description": "A flat, rectangular file used for smoothing flat surfaces and edges."
            },
            {
                "name": "Round File",
                "description": "A cylindrical file used for shaping and smoothing curved surfaces and holes."
            },
            {
                "name": "Half-round File",
                "description": "A file with one flat side and one rounded side, used for versatile shaping tasks."
            },
            {
                "name": "Rasp",
                "description": "A coarse file with raised teeth for aggressive material removal, often used in woodworking."
            },
            {
                "name": "Needle File",
                "description": "A small, fine file used for detailed work and finishing small areas."
            }
        ]
    },
    {
        "name": "Feeler Gauges",
        "description": "Feeler gauges are thin, flat strips of metal used to measure gaps and clearances between parts. They come in various thicknesses, allowing for precise measurements in mechanical applications.",
        "kit-size": "25 piece",
        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/j000aa_01_d4508dc1-9c0e-466a-a53b-a0b3c1c9737e_400x.jpg?v=1717437036"
    },
    {
        "name": "Hacksaws",
        "description": "Hacksaws are hand tools used for cutting metal and plastic materials. They consist of a frame with a serrated blade, allowing for precise cutting in various applications.",
        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/35-261_01_ebd3d26b-5020-4b69-953d-71d3271f5898_400x.jpg?v=1717438406"   
    },
    {
        "name": "Bolt Cutters",
        "description": "Bolt cutters are heavy-duty cutting tools used for cutting through thick metal rods, chains, and bolts. They feature long handles for leverage and sharp blades for efficient cutting.",
        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-22-4114_01_400x.jpg?v=1717438523"
    },
    {
        "name": "Chisels and Punches",
        "description": "Chisels and punches are tools used for cutting, shaping, and marking materials. Chisels are sharp-edged tools for carving or cutting, while punches are used to create holes or indentations in materials.",
        "kit-size": ["12 piece", "27 piece"],
        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/apex-82306_01_400x.jpg?v=1717433542"
    },
    { 
        "name": "Drill bits",
        "description": "Drill bits are cutting tools used to create holes in various materials. They come in different shapes and sizes, allowing for precise drilling in wood, metal, plastic, and other materials.",
        "types": [
            {
                "name": "Twist Drill Bit",
                "description": "A standard drill bit with a spiral design for efficient drilling in various materials."
            },
            {
                "name": "Spade Bit",
                "description": "A flat drill bit with a pointed tip, ideal for drilling large holes in wood."
            },
            {
                "name": "Hole Saw",
                "description": "A cylindrical saw used to cut large holes in wood, metal, and plastic."
            },
            {
                "name": "Masonry Bit",
                "description": "A drill bit designed for drilling into hard materials like concrete and brick."
            },
            {
                "name": "Step Bit",
                "description": "A conical drill bit with multiple cutting edges, allowing for drilling holes of various sizes."
            }, 
            {
                "name": "Countersink Bit",
                "description": "A drill bit designed to create a conical hole for flush screw heads."
            },
            {
                "name": "Auger Bit",
                "description": "A drill bit with a spiral design, ideal for drilling deep holes in wood."
            },
            {
                "name": "Forstner Bit",
                "description": "A flat-bottomed drill bit used for drilling precise holes in wood."
            },
            {
                "name": "Screw Extractor Bit",
                "description": "A specialized drill bit designed to remove broken screws or bolts."
            },
            {
                "name": "Left-hand Drill Bit",
                "description": "A drill bit designed to drill in the opposite direction, often used to remove broken screws."
            },
            {
                "name": "Pilot Bit",
                "description": "A small drill bit used to create a guide hole for larger drill bits."
            },
            {
                "name": "Brad Point Bit",
                "description": "A drill bit with a sharp point for precise drilling in wood, preventing splintering."
            }
        ],
        "kits": [
            {
                "name": "Drill Bit Set",
                "description": "A set of various drill bits, including twist, spade, and masonry bits, for versatile drilling tasks.",
                "sizes": [
                    "1/16 inch",
                    "1/8 inch",
                    "3/16 inch",
                    "1/4 inch",
                    "3/8 inch"
                ],
                "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-89-4630_01_400x.jpg?v=1717439122"
            },
            {
                "name": "Woodworking Drill Bit Set",
                "description": "A set of specialized drill bits for woodworking, including Forstner and brad point bits.",
                "sizes": [
                    "1/4 inch",
                    "3/8 inch",
                    "1/2 inch",
                    "5/8 inch",
                    "3/4 inch"
                ],
                "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-89-4630_02_400x.jpg?v=1717439205"
            }
        ]
    },
    {
        "name": "Power tools",
        "description": "Power tools are electrically or battery-operated tools that provide increased efficiency and power for various tasks. They include drills, saws, grinders, and more, allowing mechanics to perform tasks quickly and with precision.",
        "types": [
            {
                "name": "Cordless Drill",
                "description": "A battery-operated drill used for drilling holes and driving screws in various materials."
            },
            {
                "name": "Angle Grinder",
                "description": "A power tool with a rotating disc used for cutting, grinding, and polishing materials."
            },
            {
                "name": "Reciprocating Saw",
                "description": "A saw that uses a back-and-forth motion to cut through materials, ideal for demolition work."
            },
            {
                "name": "Impact Driver",
                "description": "A power tool designed for driving screws and bolts with high torque and speed."
            },
            {
                "name": "Rotary Tool",
                "description": "A versatile tool with interchangeable bits for cutting, grinding, sanding, and polishing."
            },
            {
                "name": "Jigsaw",
                "description": "A power tool with a reciprocating blade used for making intricate cuts in wood, metal, and plastic."    
            },
            {
                "name": "Circular Saw",
                "description": "A power tool with a toothed blade used for making straight cuts in wood, metal, and plastic."
            }, 
            {
                "name": "Belt Sander",
                "description": "A power tool with a continuous loop of sandpaper used for smoothing and shaping surfaces."
            },
            {
                "name": "Table Saw",
                "description": "A stationary power tool with a circular blade used for making precise cuts in wood and other materials."
            },
            {
                "name": "Miter Saw",
                "description": "A power tool with a rotating blade used for making angled cuts in wood and other materials."
            },
            {
                "name": "Drill Press",
                "description": "A stationary power tool used for drilling holes with precision and control."
            },
            {
                "name": "Nail Gun",
                "description": "A power tool that uses compressed air or electricity to drive nails into wood and other materials."
            },
            {
                "name": "Heat Gun",
                "description": "A power tool that blows hot air, used for stripping paint, shrinking tubing, and other applications."
            },
            {
                "name": "Angle Drill",
                "description": "A power tool with a right-angle head, allowing for drilling in tight spaces."
            },
            {
                "name": "Oscillating Multi-Tool",
                "description": "A versatile power tool with interchangeable attachments for cutting, sanding, and scraping."
            },
            {
                "name": "Cordless Impact Wrench",
                "description": "A battery-operated tool designed for loosening and tightening nuts and bolts with high torque."
            },
            {
                "name": "Corded Drill",
                "description": "An electric drill powered by a cord, providing continuous power for heavy-duty tasks."
            },
            {
                "name": "Angle Grinder",
                "description": "A power tool with a rotating disc used for cutting, grinding, and polishing materials."
            },
            {
                "name": "Bench Grinder",
                "description": "A stationary power tool with two grinding wheels used for sharpening tools and shaping metal."
            },
            {
                "name": "Power Sander",
                "description": "A power tool with a sanding pad used for smoothing and finishing surfaces.",
                "kits": [
                    {
                        "name": "Sander Kit",
                        "description": "A set of various sanders, including orbital, belt, and detail sanders, for versatile sanding tasks.",
                        "sizes": [
                            "1/4 sheet sander",
                            "Orbital sander",
                            "Belt sander",
                            "Detail sander"
                        ],
                        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-40-4110_01_400x.jpg?v=1717439405"
                    }
                ]       
            },
            {
                "name": "Air compressor",
                "description": "A power tool that compresses air for use in pneumatic tools, inflating tires, and other applications.", 
                "kits": [
                    {
                        "name": "Air Compressor Kit",
                        "description": "A set of air compressor and accessories, including hoses, nozzles, and fittings, for various pneumatic tasks.",
                        "sizes": [
                            "1 gallon",
                            "2 gallon",
                            "4 gallon"
                        ],
                        "image": "https://cdn.shopify.com/s/files/1/0717/0159/4403/files/milwaukee-48-89-4630_02_400x.jpg?v=1717439205"
                    }
                ]   
            }
        ]   

    },
{
    "name": "Measurement Tools",
    "description": "Measurement tools are essential for ensuring accuracy and precision in mechanical tasks. They include tape measures, calipers, micrometers, and levels, allowing mechanics to measure dimensions, angles, and distances accurately.",
    "types": [
        {
            "name": "Tape Measure",
            "description": "A flexible measuring tool used for measuring lengths and distances, often with a retractable tape."
        },
        {
            "name": "Caliper",
            "description": "A precision measuring tool used to measure internal and external dimensions, as well as depths."
        },
        {
            "name": "Micrometer",
            "description": "A highly accurate measuring tool used for measuring small distances and thicknesses."
        },
        {
            "name": "Level",
            "description": "A tool used to determine whether a surface is horizontal or vertical, often with a bubble vial."
        },
        {
            "name": "Protractor",
            "description": "A tool used to measure angles, often with a rotating arm and degree markings."
        },
        {
            "name": "Ruler",
            "description": "A straight measuring tool used for measuring lengths and drawing straight lines."
        },
        {
            "name": "Laser Distance Measurer",
            "description": "A digital tool that uses laser technology to measure distances accurately and quickly."
        },
        {
            "name": "Angle Finder",
            "description": "A tool used to measure and set angles, often with a protractor-like design."
        },
        {
            "name": "Feeler Gauge",
            "description": "A set of thin metal strips used to measure gaps and clearances between parts."
        },
        {
            "name": "Depth Gauge",
            "description": "A tool used to measure the depth of holes or recesses, often with a graduated scale."
        },
        {
            "name": "Tachometer",
            "description": "A device used to measure the rotational speed of an engine or motor, often with a digital display."
        },
        {
            "name": "Multimeter",
            "description": "An electronic measuring instrument used to measure voltage, current, and resistance in electrical circuits."
        }
    ]
}
    ]
}
]