{
    "class": "PPE",
    "type": "satety",
    "priority": ["First", "High"],
    "description": "Personal Protective Equipment (PPE) is essential for ensuring the safety and health of individuals in various work environments. PPE includes a wide range of equipment designed to protect against hazards that can cause injury or illness. This equipment is used across different industries, including construction, manufacturing, healthcare, and more. The following categories outline the types of PPE commonly used:",
    "categories": [
        {
            "name": "Head Protection",
            "description": "Equipment designed to protect the head from injuries due to falling objects, bumps, or electrical hazards.",
            "items": [
                {
                    "name": "Hard Hat",
                    "description": "A helmet made of durable materials to protect against impact and penetration."
                },
                {
                    "name": "Bump Cap",
                    "description": "A lightweight cap that provides protection against minor bumps and scrapes."
                }
            ]
        },
        {
            "name": "Eye and Face Protection",
            "description": "Equipment designed to protect the eyes and face from hazards such as flying particles, chemicals, and radiation.",
            "items": [
                {
                    "name": "Safety Glasses",
                    "description": "Glasses with impact-resistant lenses to protect against flying debris."
                },
                {
                    "name": "Face Shield",
                    "description": "A transparent shield that covers the entire face for protection against splashes and impacts."
                }
            ]
        },
        {
            "name": "Hearing Protection",
            "description": "Equipment designed to protect the ears from excessive noise levels.",
            "items": [
                {
                    "name": "Earplugs",
                    "description": "Small devices inserted into the ear canal to reduce noise exposure."
                },
                {
                    "name": "Earmuffs",
                    "description": "Headphones that cover the ears to block out noise."
                }
            ]
        },
        {
            "name": "Respiratory Protection",
            "description": "Equipment designed to protect the respiratory system from harmful airborne substances.",
            "items": [
                {
                    "name": "Dust Mask",
                    "description": "A lightweight mask that filters out dust and other particles."
                },
                {
                    "name": "Respirator",
                    "description": "A device that provides a secure seal around the face and filters out harmful gases and vapors."
                }
            ]
        },
        {
            "name": "Hand Protection",
            "description": "Equipment designed to protect the hands from cuts, abrasions, chemicals, and heat.",
            "items": [
                {
                    "name": "Work Gloves",
                    "description": "Gloves made of various materials for different types of hand protection."
                },
                {
                    "name": "Chemical Resistant Gloves",
                    "description": "Gloves designed to protect against chemical exposure."
                }
            ]
        },
        {
            "name": "Foot Protection",
            "description": "Equipment designed to protect the feet from injuries such as crushing, punctures, and slips.",
            "items": [
                {
                    "name": "Safety Boots",
                    "description": "Boots with reinforced toes and slip-resistant soles."
                },
                {
                    "name": "Steel-Toed Shoes",
                    "description": "Shoes with a steel cap over the toes for added protection."
                }
            ]
        },
        {
            "name": "Body Protection",
            "description": "Equipment designed to protect the body from hazards such as chemicals, heat, and sharp objects.",
            "items": [
                {
                    "name": "Coveralls",
                    "description": "Full-body suits that provide protection against chemicals and dirt."
                },
                {
                    "name": "Aprons",
                    "description": "Protective garments worn over clothing to shield against spills and splashes."
                }
            ]
        }
    ]
}