[{
    "class": "fastener",
    "type": "screw",
    "description": "A type of fastener characterized by a helical ridge, known as a thread, which is wrapped around a cylinder. Screws are used to hold objects together and can be driven into materials using a screwdriver or drill.",
    "types": [
        {
            "name": "Wood screw",
            "description": "A screw designed for use in wood, featuring a sharp point and coarse threads to grip the wood fibers."
        },
        {
            "name": "Machine screw",
            "description": "A screw with a uniform diameter and fine threads, used with nuts or tapped holes."
        },
        {
            "name": "Self-tapping screw",
            "description": "A screw that can tap its own hole as it is driven into the material, eliminating the need for a pre-drilled hole."
        },
        {
            "name": "Sheet metal screw",
            "description": "A screw designed for fastening metal sheets, featuring sharp threads and a pointed tip."
        },
        {
            "name": "Lag screw",
            "description": "A heavy-duty screw used for fastening large wooden structures, requiring a wrench for installation."
        },
        {
            "name": "Deck screw",
            "description": "A corrosion-resistant screw designed for outdoor decking applications, often featuring a special coating."
        },
        {
            "name": "Drywall screw",
            "description": "A fine-threaded screw used for attaching drywall to wooden or metal studs."
        },
        {
            "name": "Concrete screw",
            "description": "A hardened steel screw designed for anchoring into concrete, masonry, or brick."
        },
        {
            "name": "Set screw",
            "description": "A screw used to secure an object within or against another object, typically without a head."
        },
        {
            "name": "Thumb screw",
            "description": "A screw with a knurled head that can be tightened or loosened by hand, without the need for tools."
        },
        {
            "name": "Socket screw",
            "description": "A screw with a hexagonal socket in the head, designed to be driven by an Allen wrench or hex key."
        },      
        {
            "name": "Cap screw",
            "description": "A screw with a cylindrical head and a hexagonal drive, used for fastening parts together."
        },  
        {
            "name": "Square drive screw",
            "description": "A screw with a square-shaped socket in the head, designed to be driven by a square drive bit."
        },
        {
            "name": "Security screw",
            "description": "A screw designed with a unique drive pattern to prevent unauthorized removal, often used in public installations."
        },
        {
            "name": "Woodruff key screw",
            "description": "A screw that incorporates a Woodruff key to prevent rotation in applications where rotational force is applied."
        },
        {
            "name": "Tapping screw",
            "description": "A screw designed to create its own thread in a pre-drilled hole, often used in metal applications."
        },
        {
            "name": "Binder screw",
            "description": "A screw used to bind or hold together multiple sheets of material, often found in binders or folders."
        },
        {
            "name": "Chipboard screw",
            "description": "A screw specifically designed for use in chipboard or particle board, featuring coarse threads for better grip."    
        }          
    ]
}
]